<template>
  <div class="newsList">
    <el-row class="newsTitle">
      <h1>大题目</h1>
    </el-row>
    <el-row class="newsTime">
      <p>1/23</p>
    </el-row>
    <el-row class="newsContent">
        <p>{{newsList}}</p>
    </el-row>
    
  </div>
    

  
</template>

<script scoped>
export default {
  data(){
    return {
      newsList : `请各学院认真对照人才培养方案，指导学生按要求选课，以完成人才培养方案中规定的修读学分。
                二、不得选修与本专业培养方案中专业必修课或专业选修课相同或相近的课程、不得选修与已经选修并取得学分的课程相同或相近的课程，否则不能取得该课程的学分。
                三、选课采取网上报名的形式。请各学院通知学生请各学院认真对照人才培养方案，指导学生按要求选课，以完成人才培养方案中规定的修读学分。
                二、不得选修与本专业培养方案中专业必修课或专业选修课相同或相近的课程、不得选修与已经选修并取得学分的课程相同或相近的课程，否则不能取得该课程的学分。
                三、选课采取网上报名的形式。请各学院通知学生请各学院认真对照人才培养方案，指导学生按要求选课，以完成人才培养方案中规定的修读学分。
                二、不得选修与本专业培养方案中专业必修课或专业选修课相同或相近的课程、不得选修与已经选修并取得学分的课程相同或相近的课程，否则不能取得该课程的学分。
                三、选课采取网上报名的形式。请各学院通知学生请各学院认真对照人才培养方案，指导学生按要求选课，以完成人才培养方案中规定的修读学分。
                二、不得选修与本专业培养方案中专业必修课或专业选修课相同或相近的课程、不得选修与已经选修并取得学分的课程相同或相近的课程，否则不能取得该课程的学分。
                三、选课采取网上报名的形式。请各学院通知学生请各学院认真对照人才培养方案，指导学生按要求选课，以完成人才培养方案中规定的修读学分。
                二、不得选修与本专业培养方案中专业必修课或专业选修课相同或相近的课程、不得选修与已经选修并取得学分的课程相同或相近的课程，否则不能取得该课程的学分。
                三、选课采取网上报名的形式。请各学院通知学生请各学院认真对照人才培养方案，指导学生按要求选课，以完成人才培养方案中规定的修读学分。
                二、不得选修与本专业培养方案中专业必修课或专业选修课相同或相近的课程、不得选修与已经选修并取得学分的课程相同或相近的课程，否则不能取得该课程的学分。
                三、选课采取网上报名的形式。请各学院通知学生请各学院认真对照人才培养方案，指导学生按要求选课，以完成人才培养方案中规定的修读学分。
                二、不得选修与本专业培养方案中专业必修课或专业选修课相同或相近的课程、不得选修与已经选修并取得学分的课程相同或相近的课程，否则不能取得该课程的学分。
                三、选课采取网上报名的形式。请各学院通知学生请各学院认真对照人才培养方案，指导学生按要求选课，以完成人才培养方案中规定的修读学分。
                二、不得选修与本专业培养方案中专业必修课或专业选修课相同或相近的课程、不得选修与已经选修并取得学分的课程相同或相近的课程，否则不能取得该课程的学分。
                三、选课采取网上报名的形式。请各学院通知学生请各学院认真对照人才培养方案，指导学生按要求选课，以完成人才培养方案中规定的修读学分。
                二、不得选修与本专业培养方案中专业必修课或专业选修课相同或相近的课程、不得选修与已经选修并取得学分的课程相同或相近的课程，否则不能取得该课程的学分。
                三、选课采取网上报名的形式。请各学院通知学生请各学院认真对照人才培养方案，指导学生按要求选课，以完成人才培养方案中规定的修读学分。
                二、不得选修与本专业培养方案中专业必修课或专业选修课相同或相近的课程、不得选修与已经选修并取得学分的课程相同或相近的课程，否则不能取得该课程的学分。
                三、选课采取网上报名的形式。请各学院通知学生请各学院认真对照人才培养方案，指导学生按要求选课，以完成人才培养方案中规定的修读学分。
                二、不得选修与本专业培养方案中专业必修课或专业选修课相同或相近的课程、不得选修与已经选修并取得学分的课程相同或相近的课程，否则不能取得该课程的学分。
                三、选课采取网上报名的形式。请各学院通知学生请各学院认真对照人才培养方案，指导学生按要求选课，以完成人才培养方案中规定的修读学分。
                二、不得选修与本专业培养方案中专业必修课或专业选修课相同或相近的课程、不得选修与已经选修并取得学分的课程相同或相近的课程，否则不能取得该课程的学分。
                三、选课采取网上报名的形式。请各学院通知学生`
    }
  }
};
</script>

<style lang = "scss" scoped>
  .newsList{
    .newsTitle{
      text-align:center;
      font-size:22px;
      line-height:22px;
    }
    .newsTime p{
      float:right;
    }
    .newsContent{
      padding:10px;
      p{
        font-size:16px;
        
      }
    }
  }

</style>
